#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/pomelo-test/AWS-Lambda-and-DynamoDB/runs/run-vdjcHnLkrShB3X3A

Waiting for the plan to start...

Terraform v0.14.7
Configuring remote state backend...
Initializing Terraform configuration...

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_api_gateway_integration.UserAPIIntMethodGET will be created
  + resource "aws_api_gateway_integration" "UserAPIIntMethodGET" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # aws_api_gateway_integration.UserAPIIntMethodPOST will be created
  + resource "aws_api_gateway_integration" "UserAPIIntMethodPOST" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # aws_api_gateway_method.UserAPIMethodGET will be created
  + resource "aws_api_gateway_method" "UserAPIMethodGET" {
      + api_key_required   = false
      + authorization      = "NONE"
      + http_method        = "GET"
      + id                 = (known after apply)
      + request_parameters = {
          + "method.request.header.content-type" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = (known after apply)
    }

  # aws_api_gateway_method.UserAPIMethodPOST will be created
  + resource "aws_api_gateway_method" "UserAPIMethodPOST" {
      + api_key_required   = false
      + authorization      = "NONE"
      + http_method        = "POST"
      + id                 = (known after apply)
      + request_models     = {
          + "application/json" = "userpostmodel"
        }
      + request_parameters = {
          + "method.request.header.content-type" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = (known after apply)
    }

  # aws_api_gateway_method_response.UserAPIMethodGETResponse will be created
  + resource "aws_api_gateway_method_response" "UserAPIMethodGETResponse" {
      + http_method = "GET"
      + id          = (known after apply)
      + resource_id = (known after apply)
      + rest_api_id = (known after apply)
      + status_code = "200"
    }

  # aws_api_gateway_method_response.UserAPIMethodPOSTResponse will be created
  + resource "aws_api_gateway_method_response" "UserAPIMethodPOSTResponse" {
      + http_method = "POST"
      + id          = (known after apply)
      + resource_id = (known after apply)
      + rest_api_id = (known after apply)
      + status_code = "200"
    }

  # aws_api_gateway_model.UserPostModel will be created
  + resource "aws_api_gateway_model" "UserPostModel" {
      + content_type = "application/json"
      + description  = "a JSON schema"
      + id           = (known after apply)
      + name         = "userpostmodel"
      + rest_api_id  = (known after apply)
      + schema       = jsonencode(
            {
              + $schema    = "http://json-schema.org/draft-04/schema#"
              + properties = {
                  + firstname = {
                      + type = "string"
                    }
                  + id        = {
                      + type = "string"
                    }
                  + lastname  = {
                      + type = "string"
                    }
                }
              + title      = "UserPostModel"
              + type       = "object"
            }
        )
    }

  # aws_api_gateway_resource.GetUserAPIResource will be created
  + resource "aws_api_gateway_resource" "GetUserAPIResource" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "{id}"
      + rest_api_id = (known after apply)
    }

  # aws_api_gateway_resource.UserAPIResource will be created
  + resource "aws_api_gateway_resource" "UserAPIResource" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "user"
      + rest_api_id = (known after apply)
    }

  # aws_api_gateway_rest_api.UserAPI will be created
  + resource "aws_api_gateway_rest_api" "UserAPI" {
      + api_key_source               = (known after apply)
      + arn                          = (known after apply)
      + binary_media_types           = (known after apply)
      + created_date                 = (known after apply)
      + description                  = "This is my API for demonstration purposes"
      + disable_execute_api_endpoint = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + minimum_compression_size     = -1
      + name                         = "UserAPI"
      + policy                       = (known after apply)
      + root_resource_id             = (known after apply)

      + endpoint_configuration {
          + types            = (known after apply)
          + vpc_endpoint_ids = (known after apply)
        }
    }

  # aws_dynamodb_table.basic-dynamodb-table will be created
  + resource "aws_dynamodb_table" "basic-dynamodb-table" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "id"
      + id               = (known after apply)
      + name             = "Users"
      + read_capacity    = 20
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "production"
          + "Name"        = "dynamodb-table-1"
        }
      + write_capacity   = 20

      + attribute {
          + name = "id"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled = (known after apply)
        }

      + server_side_encryption {
          + enabled     = (known after apply)
          + kms_key_arn = (known after apply)
        }
    }

  # aws_dynamodb_table_item.example will be created
  + resource "aws_dynamodb_table_item" "example" {
      + hash_key   = "id"
      + id         = (known after apply)
      + item       = jsonencode(
            {
              + firstname = {
                  + S = "John"
                }
              + id        = {
                  + S = "12345"
                }
              + lastname  = {
                  + S = "Doe"
                }
            }
        )
      + table_name = "Users"
    }

  # aws_iam_role.lambda_exec will be created
  + resource "aws_iam_role" "lambda_exec" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "LambdaDynamoDBRoleTF"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy.dynamo_rw_access will be created
  + resource "aws_iam_role_policy" "dynamo_rw_access" {
      + id     = (known after apply)
      + name   = "DynamoReadWriteAccess"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "dynamodb:PutItem",
                          + "dynamodb:GetItem",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:dynamodb:us-west-1:659043227432:table/Users"
                      + Sid      = "VisualEditor0"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # aws_iam_role_policy_attachment.lambda_basic_execution_role will be created
  + resource "aws_iam_role_policy_attachment" "lambda_basic_execution_role" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "LambdaDynamoDBRoleTF"
    }

  # aws_lambda_function.getUserDataTF will be created
  + resource "aws_lambda_function" "getUserDataTF" {
      + arn                            = (known after apply)
      + function_name                  = "getUserData"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs14.x"
      + s3_bucket                      = "get-user-data-tf"
      + s3_key                         = "v1.0.0/getUserData.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # aws_lambda_function.putUserDataTF will be created
  + resource "aws_lambda_function" "putUserDataTF" {
      + arn                            = (known after apply)
      + function_name                  = "putUserData"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs14.x"
      + s3_bucket                      = "get-user-data-tf"
      + s3_key                         = "v1.0.0/putUserData.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # aws_lambda_permission.lambda_get_permission will be created
  + resource "aws_lambda_permission" "lambda_get_permission" {
      + action        = "lambda:InvokeFunction"
      + function_name = "getUserData"
      + id            = (known after apply)
      + principal     = "apigateway.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowMyDemoAPIInvoke"
    }

  # aws_lambda_permission.lambda_permission will be created
  + resource "aws_lambda_permission" "lambda_permission" {
      + action        = "lambda:InvokeFunction"
      + function_name = "putUserData"
      + id            = (known after apply)
      + principal     = "apigateway.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowMyDemoAPIInvoke"
    }

Plan: 19 to add, 0 to change, 0 to destroy.
```

</details>

*Pusher: @PunPomelo, Action: `pull_request`*